================================================================================
Empty declarations
================================================================================

--------------------------------------------------------------------------------

(source_file)

================================================================================
Variable declaration
================================================================================

var a := 12

--------------------------------------------------------------------------------

(source_file
  (variable_declaration
    name: (identifier)
    value: (integer_literal)))

================================================================================
Variable declaration with type
================================================================================

var a : int := 27

--------------------------------------------------------------------------------

(source_file
  (variable_declaration
    name: (identifier)
    type: (identifier)
    value: (integer_literal)))

================================================================================
Multiple variable declarations
================================================================================

var a := 12
var b := 27

--------------------------------------------------------------------------------

(source_file
  (variable_declaration
    name: (identifier)
    value: (integer_literal))
  (variable_declaration
    name: (identifier)
    value: (integer_literal)))

================================================================================
Import
================================================================================

import "a.tih"

--------------------------------------------------------------------------------

(source_file
  (import_declaration
    file: (string_literal)))

================================================================================
Multiple imports
================================================================================

import "a.tih"
import "b.tih"

--------------------------------------------------------------------------------

(source_file
  (import_declaration
    file: (string_literal))
  (import_declaration
    file: (string_literal)))
